mathe/division_mit_rest.html
---
layout: page
title: Division_mit_rest
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Division mit Rest</h2>
<div class="outline-text-2" id="text-1">
<p>
Zu jedem Zahlenpaar
\((a,d) \in \mathbb{Z} \times \mathbb{Z} \setminus \\{ 0 \\}\) gibt es
eindeutig bestimmte Zahlen \(q,r \in \mathbb{Z}\) mit \(a = dq + r\) und
\(0 \leq r < |d|\).
</p>

<p>
Wenn \(r = 0\) gilt, so heißt \(d\) Teiler von \(a\) (s.a.
<i>Teilbarkeitsrelation</i>).
</p>

<p>
Die Eindeutigkeit des (positiven Rests) wird in Programmierpsrachen in
de Implementierung der Modulooperation ausgenutzt. Diese gibt i.R. den
positiven Rest einer Division zurück.
</p>
</div>
</div>
